Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 16) 448         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 128, 128, 16) 64          conv2d[0][0]                     
__________________________________________________________________________________________________
instance_normalization (Instanc (None, 128, 128, 16) 2           batch_normalization[0][0]        
__________________________________________________________________________________________________
activation (Activation)         (None, 128, 128, 16) 0           instance_normalization[0][0]     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 16) 2320        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 128, 16) 64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 128, 128, 16) 2           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 128, 128, 16) 0           instance_normalization_1[0][0]   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 64, 64, 16)   0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 64, 64, 32)   4640        max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 64, 64, 32)   128         conv2d_2[0][0]                   
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 64, 64, 32)   2           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 64, 64, 32)   0           instance_normalization_2[0][0]   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 64, 32)   9248        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 64, 64, 32)   128         conv2d_3[0][0]                   
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 64, 64, 32)   2           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64, 64, 32)   0           instance_normalization_3[0][0]   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 32, 32)   0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 64)   18496       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 64)   256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 32, 32, 64)   2           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 64)   0           instance_normalization_4[0][0]   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 64)   36928       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 64)   256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 32, 32, 64)   2           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 64)   0           instance_normalization_5[0][0]   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 16, 16, 64)   0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 128)  73856       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16, 16, 128)  512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 16, 16, 128)  2           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 16, 16, 128)  0           instance_normalization_6[0][0]   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 128)  147584      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 16, 16, 128)  512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 16, 16, 128)  2           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 16, 16, 128)  0           instance_normalization_7[0][0]   
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 32, 32, 128)  65664       activation_7[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 32, 32, 192)  0           conv2d_transpose[0][0]           
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 128)  221312      concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 32, 128)  512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 32, 32, 128)  2           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 32, 128)  0           instance_normalization_8[0][0]   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 128)  147584      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 32, 128)  512         conv2d_9[0][0]                   
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 32, 32, 128)  2           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 32, 128)  0           instance_normalization_9[0][0]   
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 64, 64, 64)   32832       activation_9[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 64, 96)   0           conv2d_transpose_1[0][0]         
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 64)   55360       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64, 64, 64)   256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 64, 64, 64)   2           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 64, 64, 64)   0           instance_normalization_10[0][0]  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 64)   36928       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 64, 64)   256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
instance_normalization_11 (Inst (None, 64, 64, 64)   2           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 64, 64, 64)   0           instance_normalization_11[0][0]  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 128, 128, 32) 8224        activation_11[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128, 48) 0           conv2d_transpose_2[0][0]         
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 128, 32) 13856       concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 128, 128, 32) 128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
instance_normalization_12 (Inst (None, 128, 128, 32) 2           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 128, 128, 32) 0           instance_normalization_12[0][0]  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 128, 32) 9248        activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 128, 128, 32) 128         conv2d_13[0][0]                  
__________________________________________________________________________________________________
instance_normalization_13 (Inst (None, 128, 128, 32) 2           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 128, 128, 32) 0           instance_normalization_13[0][0]  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 128, 128, 3)  99          activation_13[0][0]              
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 128, 128, 3)  0           conv2d_14[0][0]                  
==================================================================================================
Total params: 888,367
Trainable params: 886,511
Non-trainable params: 1,856
__________________________________________________________________________________________________
None
