Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 4)  112         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 128, 4)  16          conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 8)  296         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 8)  32          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 128, 13) 949         batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 128, 13) 52          conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 25) 100         input_1[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 128, 128, 25) 0           batch_normalization_1[0][0]      
                                                                 batch_normalization_2[0][0]      
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 128, 128, 25) 100         conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 128, 25) 100         concatenate[0][0]                
__________________________________________________________________________________________________
add (Add)                       (None, 128, 128, 25) 0           batch_normalization[0][0]        
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation (Activation)         (None, 128, 128, 25) 0           add[0][0]                        
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 64, 32)   7232        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64, 64, 32)   128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64, 64, 32)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 64, 64, 8)    2312        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 64, 64, 8)    32          conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 64, 64, 17)   1241        batch_normalization_22[0][0]     
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 64, 64, 17)   68          conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 64, 64, 26)   4004        batch_normalization_23[0][0]     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 64, 64, 26)   104         conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 64, 64, 51)   1683        activation_1[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 64, 51)   0           batch_normalization_22[0][0]     
                                                                 batch_normalization_23[0][0]     
                                                                 batch_normalization_24[0][0]     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 64, 64, 51)   204         conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 64, 64, 51)   204         concatenate_1[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 64, 64, 51)   0           batch_normalization_21[0][0]     
                                                                 batch_normalization_25[0][0]     
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 64, 51)   0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 32, 32, 64)   29440       activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 32, 32, 64)   256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 32, 64)   0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 32, 32, 17)   9809        activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 32, 32, 17)   68          conv2d_29[0][0]                  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 32, 32, 35)   5390        batch_normalization_40[0][0]     
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 32, 32, 35)   140         conv2d_30[0][0]                  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 32, 32, 53)   16748       batch_normalization_41[0][0]     
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 32, 32, 53)   212         conv2d_31[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 32, 32, 105)  6825        activation_8[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 32, 105)  0           batch_normalization_40[0][0]     
                                                                 batch_normalization_41[0][0]     
                                                                 batch_normalization_42[0][0]     
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 32, 32, 105)  420         conv2d_28[0][0]                  
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 32, 32, 105)  420         concatenate_2[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 32, 32, 105)  0           batch_normalization_39[0][0]     
                                                                 batch_normalization_43[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 32, 32, 105)  0           add_11[0][0]                     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 16, 16, 128)  121088      activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 16, 16, 128)  512         conv2d_32[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 16, 16, 128)  0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 16, 16, 35)   40355       activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_55 (BatchNo (None, 16, 16, 35)   140         conv2d_40[0][0]                  
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 16, 16, 71)   22436       batch_normalization_55[0][0]     
__________________________________________________________________________________________________
batch_normalization_56 (BatchNo (None, 16, 16, 71)   284         conv2d_41[0][0]                  
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 16, 16, 106)  67840       batch_normalization_56[0][0]     
__________________________________________________________________________________________________
batch_normalization_57 (BatchNo (None, 16, 16, 106)  424         conv2d_42[0][0]                  
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 16, 16, 212)  27348       activation_14[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 16, 16, 212)  0           batch_normalization_55[0][0]     
                                                                 batch_normalization_56[0][0]     
                                                                 batch_normalization_57[0][0]     
__________________________________________________________________________________________________
batch_normalization_54 (BatchNo (None, 16, 16, 212)  848         conv2d_39[0][0]                  
__________________________________________________________________________________________________
batch_normalization_58 (BatchNo (None, 16, 16, 212)  848         concatenate_3[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, 16, 16, 212)  0           batch_normalization_54[0][0]     
                                                                 batch_normalization_58[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 16, 16, 212)  0           add_15[0][0]                     
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 8, 8, 256)    488704      activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_59 (BatchNo (None, 8, 8, 256)    1024        conv2d_43[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 256)    0           batch_normalization_59[0][0]     
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 8, 8, 71)     163655      activation_19[0][0]              
__________________________________________________________________________________________________
batch_normalization_67 (BatchNo (None, 8, 8, 71)     284         conv2d_49[0][0]                  
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 8, 8, 142)    90880       batch_normalization_67[0][0]     
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 16, 16, 128)  27264       activation_18[0][0]              
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 16, 16, 128)  244352      activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_68 (BatchNo (None, 8, 8, 142)    568         conv2d_50[0][0]                  
__________________________________________________________________________________________________
batch_normalization_60 (BatchNo (None, 16, 16, 128)  512         conv2d_44[0][0]                  
__________________________________________________________________________________________________
batch_normalization_61 (BatchNo (None, 16, 16, 128)  512         conv2d_45[0][0]                  
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 8, 8, 213)    272427      batch_normalization_68[0][0]     
__________________________________________________________________________________________________
add_16 (Add)                    (None, 16, 16, 128)  0           batch_normalization_60[0][0]     
                                                                 batch_normalization_61[0][0]     
__________________________________________________________________________________________________
batch_normalization_69 (BatchNo (None, 8, 8, 213)    852         conv2d_51[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 16, 16, 128)  0           add_16[0][0]                     
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 8, 8, 426)    109482      activation_19[0][0]              
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 8, 8, 426)    0           batch_normalization_67[0][0]     
                                                                 batch_normalization_68[0][0]     
                                                                 batch_normalization_69[0][0]     
__________________________________________________________________________________________________
batch_normalization_62 (BatchNo (None, 16, 16, 128)  512         activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_66 (BatchNo (None, 8, 8, 426)    1704        conv2d_48[0][0]                  
__________________________________________________________________________________________________
batch_normalization_70 (BatchNo (None, 8, 8, 426)    1704        concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 16, 16, 128)  16512       batch_normalization_62[0][0]     
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 16, 16, 128)  147584      batch_normalization_62[0][0]     
__________________________________________________________________________________________________
add_18 (Add)                    (None, 8, 8, 426)    0           batch_normalization_66[0][0]     
                                                                 batch_normalization_70[0][0]     
__________________________________________________________________________________________________
batch_normalization_63 (BatchNo (None, 16, 16, 128)  512         conv2d_46[0][0]                  
__________________________________________________________________________________________________
batch_normalization_64 (BatchNo (None, 16, 16, 128)  512         conv2d_47[0][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 8, 8, 426)    0           add_18[0][0]                     
__________________________________________________________________________________________________
add_17 (Add)                    (None, 16, 16, 128)  0           batch_normalization_63[0][0]     
                                                                 batch_normalization_64[0][0]     
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 16, 16, 256)  436480      activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_65 (BatchNo (None, 16, 16, 128)  512         add_17[0][0]                     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 32, 32, 64)   6784        activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 32, 32, 64)   60544       activation_13[0][0]              
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 16, 16, 384)  0           conv2d_transpose[0][0]           
                                                                 batch_normalization_65[0][0]     
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 32, 32, 64)   256         conv2d_33[0][0]                  
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 32, 32, 64)   256         conv2d_34[0][0]                  
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 16, 16, 71)   245447      concatenate_5[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 32, 32, 64)   0           batch_normalization_45[0][0]     
                                                                 batch_normalization_46[0][0]     
__________________________________________________________________________________________________
batch_normalization_72 (BatchNo (None, 16, 16, 71)   284         conv2d_53[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 32, 32, 64)   0           add_12[0][0]                     
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 16, 16, 142)  90880       batch_normalization_72[0][0]     
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 32, 32, 64)   256         activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_73 (BatchNo (None, 16, 16, 142)  568         conv2d_54[0][0]                  
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 32, 32, 64)   4160        batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 32, 32, 64)   36928       batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 16, 16, 213)  272427      batch_normalization_73[0][0]     
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 32, 32, 64)   256         conv2d_35[0][0]                  
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 32, 32, 64)   256         conv2d_36[0][0]                  
__________________________________________________________________________________________________
batch_normalization_74 (BatchNo (None, 16, 16, 213)  852         conv2d_55[0][0]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 32, 32, 64)   0           batch_normalization_48[0][0]     
                                                                 batch_normalization_49[0][0]     
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 16, 16, 426)  164010      concatenate_5[0][0]              
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 16, 16, 426)  0           batch_normalization_72[0][0]     
                                                                 batch_normalization_73[0][0]     
                                                                 batch_normalization_74[0][0]     
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 32, 32, 64)   256         add_13[0][0]                     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 64, 64, 32)   1664        activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 64, 64, 32)   14720       activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_71 (BatchNo (None, 16, 16, 426)  1704        conv2d_52[0][0]                  
__________________________________________________________________________________________________
batch_normalization_75 (BatchNo (None, 16, 16, 426)  1704        concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 32, 32, 64)   4160        batch_normalization_50[0][0]     
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 32, 32, 64)   36928       batch_normalization_50[0][0]     
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 64, 64, 32)   128         conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 64, 64, 32)   128         conv2d_21[0][0]                  
__________________________________________________________________________________________________
add_19 (Add)                    (None, 16, 16, 426)  0           batch_normalization_71[0][0]     
                                                                 batch_normalization_75[0][0]     
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, 32, 32, 64)   256         conv2d_37[0][0]                  
__________________________________________________________________________________________________
batch_normalization_52 (BatchNo (None, 32, 32, 64)   256         conv2d_38[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 64, 64, 32)   0           batch_normalization_27[0][0]     
                                                                 batch_normalization_28[0][0]     
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 16, 16, 426)  0           add_19[0][0]                     
__________________________________________________________________________________________________
add_14 (Add)                    (None, 32, 32, 64)   0           batch_normalization_51[0][0]     
                                                                 batch_normalization_52[0][0]     
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 64, 32)   0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 32, 32, 128)  218240      activation_23[0][0]              
__________________________________________________________________________________________________
batch_normalization_53 (BatchNo (None, 32, 32, 64)   256         add_14[0][0]                     
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 64, 64, 32)   128         activation_9[0][0]               
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 32, 32, 192)  0           conv2d_transpose_1[0][0]         
                                                                 batch_normalization_53[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 64, 64, 32)   1056        batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 64, 64, 32)   9248        batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 32, 32, 35)   60515       concatenate_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 64, 64, 32)   128         conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 64, 64, 32)   128         conv2d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_77 (BatchNo (None, 32, 32, 35)   140         conv2d_57[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 64, 64, 32)   0           batch_normalization_30[0][0]     
                                                                 batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 32, 32, 71)   22436       batch_normalization_77[0][0]     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 64, 64, 32)   128         add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 16) 416         activation[0][0]                 
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 16) 3616        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_78 (BatchNo (None, 32, 32, 71)   284         conv2d_58[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 64, 64, 32)   1056        batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 64, 64, 32)   9248        batch_normalization_32[0][0]     
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 16) 64          conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 128, 128, 16) 64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 32, 32, 106)  67840       batch_normalization_78[0][0]     
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 64, 64, 32)   128         conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 64, 64, 32)   128         conv2d_25[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 128, 128, 16) 0           batch_normalization_6[0][0]      
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_79 (BatchNo (None, 32, 32, 106)  424         conv2d_59[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 64, 64, 32)   0           batch_normalization_33[0][0]     
                                                                 batch_normalization_34[0][0]     
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 128, 16) 0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 32, 32, 212)  40916       concatenate_7[0][0]              
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 32, 32, 212)  0           batch_normalization_77[0][0]     
                                                                 batch_normalization_78[0][0]     
                                                                 batch_normalization_79[0][0]     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 64, 64, 32)   128         add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128, 128, 16) 64          activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_76 (BatchNo (None, 32, 32, 212)  848         conv2d_56[0][0]                  
__________________________________________________________________________________________________
batch_normalization_80 (BatchNo (None, 32, 32, 212)  848         concatenate_8[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 64, 64, 32)   1056        batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 64, 64, 32)   9248        batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 16) 272         batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 16) 2320        batch_normalization_8[0][0]      
__________________________________________________________________________________________________
add_20 (Add)                    (None, 32, 32, 212)  0           batch_normalization_76[0][0]     
                                                                 batch_normalization_80[0][0]     
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 64, 64, 32)   128         conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 64, 64, 32)   128         conv2d_27[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 128, 128, 16) 64          conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 128, 128, 16) 64          conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 32, 32, 212)  0           add_20[0][0]                     
__________________________________________________________________________________________________
add_10 (Add)                    (None, 64, 64, 32)   0           batch_normalization_36[0][0]     
                                                                 batch_normalization_37[0][0]     
__________________________________________________________________________________________________
add_2 (Add)                     (None, 128, 128, 16) 0           batch_normalization_9[0][0]      
                                                                 batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 64, 64, 64)   54336       activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 64, 64, 32)   128         add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 128, 128, 16) 64          add_2[0][0]                      
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 64, 64, 96)   0           conv2d_transpose_2[0][0]         
                                                                 batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 128, 16) 272         batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 128, 16) 2320        batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 64, 64, 17)   14705       concatenate_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 128, 128, 16) 64          conv2d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 128, 128, 16) 64          conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_82 (BatchNo (None, 64, 64, 17)   68          conv2d_61[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 128, 128, 16) 0           batch_normalization_12[0][0]     
                                                                 batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 64, 64, 35)   5390        batch_normalization_82[0][0]     
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 128, 128, 16) 64          add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_83 (BatchNo (None, 64, 64, 35)   140         conv2d_62[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 128, 128, 16) 272         batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 128, 16) 2320        batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 64, 64, 53)   16748       batch_normalization_83[0][0]     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 128, 128, 16) 64          conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 128, 128, 16) 64          conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_84 (BatchNo (None, 64, 64, 53)   212         conv2d_63[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 128, 128, 16) 0           batch_normalization_15[0][0]     
                                                                 batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 64, 64, 105)  10185       concatenate_9[0][0]              
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 64, 64, 105)  0           batch_normalization_82[0][0]     
                                                                 batch_normalization_83[0][0]     
                                                                 batch_normalization_84[0][0]     
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 128, 128, 16) 64          add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_81 (BatchNo (None, 64, 64, 105)  420         conv2d_60[0][0]                  
__________________________________________________________________________________________________
batch_normalization_85 (BatchNo (None, 64, 64, 105)  420         concatenate_10[0][0]             
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 128, 16) 272         batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 128, 128, 16) 2320        batch_normalization_17[0][0]     
__________________________________________________________________________________________________
add_21 (Add)                    (None, 64, 64, 105)  0           batch_normalization_81[0][0]     
                                                                 batch_normalization_85[0][0]     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 128, 128, 16) 64          conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 128, 128, 16) 64          conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 64, 64, 105)  0           add_21[0][0]                     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 128, 128, 16) 0           batch_normalization_18[0][0]     
                                                                 batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 128, 128, 32) 13472       activation_25[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 128, 128, 16) 64          add_5[0][0]                      
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 128, 128, 48) 0           conv2d_transpose_3[0][0]         
                                                                 batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 128, 128, 8)  3464        concatenate_11[0][0]             
__________________________________________________________________________________________________
batch_normalization_87 (BatchNo (None, 128, 128, 8)  32          conv2d_65[0][0]                  
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 128, 128, 17) 1241        batch_normalization_87[0][0]     
__________________________________________________________________________________________________
batch_normalization_88 (BatchNo (None, 128, 128, 17) 68          conv2d_66[0][0]                  
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 128, 128, 26) 4004        batch_normalization_88[0][0]     
__________________________________________________________________________________________________
batch_normalization_89 (BatchNo (None, 128, 128, 26) 104         conv2d_67[0][0]                  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 128, 128, 51) 2499        concatenate_11[0][0]             
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 128, 128, 51) 0           batch_normalization_87[0][0]     
                                                                 batch_normalization_88[0][0]     
                                                                 batch_normalization_89[0][0]     
__________________________________________________________________________________________________
batch_normalization_86 (BatchNo (None, 128, 128, 51) 204         conv2d_64[0][0]                  
__________________________________________________________________________________________________
batch_normalization_90 (BatchNo (None, 128, 128, 51) 204         concatenate_12[0][0]             
__________________________________________________________________________________________________
add_22 (Add)                    (None, 128, 128, 51) 0           batch_normalization_86[0][0]     
                                                                 batch_normalization_90[0][0]     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 128, 128, 51) 0           add_22[0][0]                     
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 128, 128, 3)  156         activation_26[0][0]              
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 128, 128, 3)  0           conv2d_68[0][0]                  
==================================================================================================
Total params: 3,911,807
Trainable params: 3,897,233
Non-trainable params: 14,574
__________________________________________________________________________________________________
None
