Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 64, 64, 64,  0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 64, 64, 64, 4 328         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 64, 64, 4 16          conv3d_1[0][0]                   
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 64, 64, 64, 8 872         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 64, 64, 64, 8 32          conv3d_2[0][0]                   
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 64, 64, 64, 1 2821        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 64, 64, 64, 1 52          conv3d_3[0][0]                   
__________________________________________________________________________________________________
conv3d (Conv3D)                 (None, 64, 64, 64, 2 100         input_1[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64, 64, 64, 2 0           batch_normalization_1[0][0]      
                                                                 batch_normalization_2[0][0]      
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 64, 64, 64, 2 100         conv3d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 64, 64, 64, 2 100         concatenate[0][0]                
__________________________________________________________________________________________________
add (Add)                       (None, 64, 64, 64, 2 0           batch_normalization[0][0]        
                                                                 batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation (Activation)         (None, 64, 64, 64, 2 0           add[0][0]                        
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 32, 32, 32, 3 21632       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 32, 3 128         conv3d_4[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 32, 3 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 32, 32, 32, 8 6920        activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 32, 32, 32, 8 32          conv3d_16[0][0]                  
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 32, 32, 32, 1 3689        batch_normalization_22[0][0]     
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 32, 32, 32, 1 68          conv3d_17[0][0]                  
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 32, 32, 32, 2 11960       batch_normalization_23[0][0]     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 32, 32, 32, 2 104         conv3d_18[0][0]                  
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 32, 32, 32, 5 1683        activation_1[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 32, 5 0           batch_normalization_22[0][0]     
                                                                 batch_normalization_23[0][0]     
                                                                 batch_normalization_24[0][0]     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 32, 32, 32, 5 204         conv3d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 32, 32, 32, 5 204         concatenate_1[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 32, 32, 32, 5 0           batch_normalization_21[0][0]     
                                                                 batch_normalization_25[0][0]     
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 32, 5 0           add_6[0][0]                      
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 16, 16, 16, 6 88192       activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 16, 16, 16, 6 256         conv3d_19[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 16, 6 0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv3d_29 (Conv3D)              (None, 16, 16, 16, 1 29393       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 16, 16, 16, 1 68          conv3d_29[0][0]                  
__________________________________________________________________________________________________
conv3d_30 (Conv3D)              (None, 16, 16, 16, 3 16100       batch_normalization_40[0][0]     
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 16, 16, 16, 3 140         conv3d_30[0][0]                  
__________________________________________________________________________________________________
conv3d_31 (Conv3D)              (None, 16, 16, 16, 5 50138       batch_normalization_41[0][0]     
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 16, 16, 16, 5 212         conv3d_31[0][0]                  
__________________________________________________________________________________________________
conv3d_28 (Conv3D)              (None, 16, 16, 16, 1 6825        activation_8[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 16, 16, 16, 1 0           batch_normalization_40[0][0]     
                                                                 batch_normalization_41[0][0]     
                                                                 batch_normalization_42[0][0]     
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 16, 16, 16, 1 420         conv3d_28[0][0]                  
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 16, 16, 16, 1 420         concatenate_2[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 16, 16, 16, 1 0           batch_normalization_39[0][0]     
                                                                 batch_normalization_43[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 16, 1 0           add_11[0][0]                     
__________________________________________________________________________________________________
conv3d_32 (Conv3D)              (None, 8, 8, 8, 128) 363008      activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 8, 8, 8, 128) 512         conv3d_32[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 8, 128) 0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv3d_40 (Conv3D)              (None, 8, 8, 8, 35)  120995      activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_55 (BatchNo (None, 8, 8, 8, 35)  140         conv3d_40[0][0]                  
__________________________________________________________________________________________________
conv3d_41 (Conv3D)              (None, 8, 8, 8, 71)  67166       batch_normalization_55[0][0]     
__________________________________________________________________________________________________
batch_normalization_56 (BatchNo (None, 8, 8, 8, 71)  284         conv3d_41[0][0]                  
__________________________________________________________________________________________________
conv3d_42 (Conv3D)              (None, 8, 8, 8, 106) 203308      batch_normalization_56[0][0]     
__________________________________________________________________________________________________
batch_normalization_57 (BatchNo (None, 8, 8, 8, 106) 424         conv3d_42[0][0]                  
__________________________________________________________________________________________________
conv3d_39 (Conv3D)              (None, 8, 8, 8, 212) 27348       activation_14[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8, 8, 8, 212) 0           batch_normalization_55[0][0]     
                                                                 batch_normalization_56[0][0]     
                                                                 batch_normalization_57[0][0]     
__________________________________________________________________________________________________
batch_normalization_54 (BatchNo (None, 8, 8, 8, 212) 848         conv3d_39[0][0]                  
__________________________________________________________________________________________________
batch_normalization_58 (BatchNo (None, 8, 8, 8, 212) 848         concatenate_3[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, 8, 8, 8, 212) 0           batch_normalization_54[0][0]     
                                                                 batch_normalization_58[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 8, 212) 0           add_15[0][0]                     
__________________________________________________________________________________________________
conv3d_43 (Conv3D)              (None, 4, 4, 4, 256) 1465600     activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_59 (BatchNo (None, 4, 4, 4, 256) 1024        conv3d_43[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 4, 4, 4, 256) 0           batch_normalization_59[0][0]     
__________________________________________________________________________________________________
conv3d_49 (Conv3D)              (None, 4, 4, 4, 71)  490823      activation_19[0][0]              
__________________________________________________________________________________________________
batch_normalization_67 (BatchNo (None, 4, 4, 4, 71)  284         conv3d_49[0][0]                  
__________________________________________________________________________________________________
conv3d_50 (Conv3D)              (None, 4, 4, 4, 142) 272356      batch_normalization_67[0][0]     
__________________________________________________________________________________________________
conv3d_44 (Conv3D)              (None, 8, 8, 8, 128) 27264       activation_18[0][0]              
__________________________________________________________________________________________________
conv3d_45 (Conv3D)              (None, 8, 8, 8, 128) 732800      activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_68 (BatchNo (None, 4, 4, 4, 142) 568         conv3d_50[0][0]                  
__________________________________________________________________________________________________
batch_normalization_60 (BatchNo (None, 8, 8, 8, 128) 512         conv3d_44[0][0]                  
__________________________________________________________________________________________________
batch_normalization_61 (BatchNo (None, 8, 8, 8, 128) 512         conv3d_45[0][0]                  
__________________________________________________________________________________________________
conv3d_51 (Conv3D)              (None, 4, 4, 4, 213) 816855      batch_normalization_68[0][0]     
__________________________________________________________________________________________________
add_16 (Add)                    (None, 8, 8, 8, 128) 0           batch_normalization_60[0][0]     
                                                                 batch_normalization_61[0][0]     
__________________________________________________________________________________________________
batch_normalization_69 (BatchNo (None, 4, 4, 4, 213) 852         conv3d_51[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 8, 8, 8, 128) 0           add_16[0][0]                     
__________________________________________________________________________________________________
conv3d_48 (Conv3D)              (None, 4, 4, 4, 426) 109482      activation_19[0][0]              
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 4, 4, 4, 426) 0           batch_normalization_67[0][0]     
                                                                 batch_normalization_68[0][0]     
                                                                 batch_normalization_69[0][0]     
__________________________________________________________________________________________________
batch_normalization_62 (BatchNo (None, 8, 8, 8, 128) 512         activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_66 (BatchNo (None, 4, 4, 4, 426) 1704        conv3d_48[0][0]                  
__________________________________________________________________________________________________
batch_normalization_70 (BatchNo (None, 4, 4, 4, 426) 1704        concatenate_4[0][0]              
__________________________________________________________________________________________________
conv3d_46 (Conv3D)              (None, 8, 8, 8, 128) 16512       batch_normalization_62[0][0]     
__________________________________________________________________________________________________
conv3d_47 (Conv3D)              (None, 8, 8, 8, 128) 442496      batch_normalization_62[0][0]     
__________________________________________________________________________________________________
add_18 (Add)                    (None, 4, 4, 4, 426) 0           batch_normalization_66[0][0]     
                                                                 batch_normalization_70[0][0]     
__________________________________________________________________________________________________
batch_normalization_63 (BatchNo (None, 8, 8, 8, 128) 512         conv3d_46[0][0]                  
__________________________________________________________________________________________________
batch_normalization_64 (BatchNo (None, 8, 8, 8, 128) 512         conv3d_47[0][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 4, 4, 4, 426) 0           add_18[0][0]                     
__________________________________________________________________________________________________
add_17 (Add)                    (None, 8, 8, 8, 128) 0           batch_normalization_63[0][0]     
                                                                 batch_normalization_64[0][0]     
__________________________________________________________________________________________________
conv3d_transpose (Conv3DTranspo (None, 8, 8, 8, 256) 872704      activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_65 (BatchNo (None, 8, 8, 8, 128) 512         add_17[0][0]                     
__________________________________________________________________________________________________
conv3d_33 (Conv3D)              (None, 16, 16, 16, 6 6784        activation_13[0][0]              
__________________________________________________________________________________________________
conv3d_34 (Conv3D)              (None, 16, 16, 16, 6 181504      activation_13[0][0]              
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 8, 8, 8, 384) 0           conv3d_transpose[0][0]           
                                                                 batch_normalization_65[0][0]     
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 16, 16, 16, 6 256         conv3d_33[0][0]                  
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 16, 16, 16, 6 256         conv3d_34[0][0]                  
__________________________________________________________________________________________________
conv3d_53 (Conv3D)              (None, 8, 8, 8, 71)  736199      concatenate_5[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 16, 16, 16, 6 0           batch_normalization_45[0][0]     
                                                                 batch_normalization_46[0][0]     
__________________________________________________________________________________________________
batch_normalization_72 (BatchNo (None, 8, 8, 8, 71)  284         conv3d_53[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 16, 16, 16, 6 0           add_12[0][0]                     
__________________________________________________________________________________________________
conv3d_54 (Conv3D)              (None, 8, 8, 8, 142) 272356      batch_normalization_72[0][0]     
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 16, 16, 16, 6 256         activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_73 (BatchNo (None, 8, 8, 8, 142) 568         conv3d_54[0][0]                  
__________________________________________________________________________________________________
conv3d_35 (Conv3D)              (None, 16, 16, 16, 6 4160        batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv3d_36 (Conv3D)              (None, 16, 16, 16, 6 110656      batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv3d_55 (Conv3D)              (None, 8, 8, 8, 213) 816855      batch_normalization_73[0][0]     
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 16, 16, 16, 6 256         conv3d_35[0][0]                  
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 16, 16, 16, 6 256         conv3d_36[0][0]                  
__________________________________________________________________________________________________
batch_normalization_74 (BatchNo (None, 8, 8, 8, 213) 852         conv3d_55[0][0]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 16, 16, 16, 6 0           batch_normalization_48[0][0]     
                                                                 batch_normalization_49[0][0]     
__________________________________________________________________________________________________
conv3d_52 (Conv3D)              (None, 8, 8, 8, 426) 164010      concatenate_5[0][0]              
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 8, 8, 8, 426) 0           batch_normalization_72[0][0]     
                                                                 batch_normalization_73[0][0]     
                                                                 batch_normalization_74[0][0]     
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 16, 16, 16, 6 256         add_13[0][0]                     
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 32, 32, 32, 3 1664        activation_7[0][0]               
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 32, 32, 32, 3 44096       activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_71 (BatchNo (None, 8, 8, 8, 426) 1704        conv3d_52[0][0]                  
__________________________________________________________________________________________________
batch_normalization_75 (BatchNo (None, 8, 8, 8, 426) 1704        concatenate_6[0][0]              
__________________________________________________________________________________________________
conv3d_37 (Conv3D)              (None, 16, 16, 16, 6 4160        batch_normalization_50[0][0]     
__________________________________________________________________________________________________
conv3d_38 (Conv3D)              (None, 16, 16, 16, 6 110656      batch_normalization_50[0][0]     
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 32, 32, 32, 3 128         conv3d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 32, 32, 32, 3 128         conv3d_21[0][0]                  
__________________________________________________________________________________________________
add_19 (Add)                    (None, 8, 8, 8, 426) 0           batch_normalization_71[0][0]     
                                                                 batch_normalization_75[0][0]     
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, 16, 16, 16, 6 256         conv3d_37[0][0]                  
__________________________________________________________________________________________________
batch_normalization_52 (BatchNo (None, 16, 16, 16, 6 256         conv3d_38[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 32, 32, 32, 3 0           batch_normalization_27[0][0]     
                                                                 batch_normalization_28[0][0]     
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 8, 8, 8, 426) 0           add_19[0][0]                     
__________________________________________________________________________________________________
add_14 (Add)                    (None, 16, 16, 16, 6 0           batch_normalization_51[0][0]     
                                                                 batch_normalization_52[0][0]     
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 32, 32, 3 0           add_7[0][0]                      
__________________________________________________________________________________________________
conv3d_transpose_1 (Conv3DTrans (None, 16, 16, 16, 1 436352      activation_23[0][0]              
__________________________________________________________________________________________________
batch_normalization_53 (BatchNo (None, 16, 16, 16, 6 256         add_14[0][0]                     
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 32, 32, 32, 3 128         activation_9[0][0]               
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 16, 16, 16, 1 0           conv3d_transpose_1[0][0]         
                                                                 batch_normalization_53[0][0]     
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 32, 32, 32, 3 1056        batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (None, 32, 32, 32, 3 27680       batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv3d_57 (Conv3D)              (None, 16, 16, 16, 3 181475      concatenate_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 32, 32, 32, 3 128         conv3d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 32, 32, 32, 3 128         conv3d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_77 (BatchNo (None, 16, 16, 16, 3 140         conv3d_57[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 32, 32, 32, 3 0           batch_normalization_30[0][0]     
                                                                 batch_normalization_31[0][0]     
__________________________________________________________________________________________________
conv3d_58 (Conv3D)              (None, 16, 16, 16, 7 67166       batch_normalization_77[0][0]     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 32, 32, 32, 3 128         add_8[0][0]                      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 64, 64, 64, 1 416         activation[0][0]                 
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 64, 64, 64, 1 10816       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_78 (BatchNo (None, 16, 16, 16, 7 284         conv3d_58[0][0]                  
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (None, 32, 32, 32, 3 1056        batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv3d_25 (Conv3D)              (None, 32, 32, 32, 3 27680       batch_normalization_32[0][0]     
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 64, 64, 64, 1 64          conv3d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 64, 64, 1 64          conv3d_6[0][0]                   
__________________________________________________________________________________________________
conv3d_59 (Conv3D)              (None, 16, 16, 16, 1 203308      batch_normalization_78[0][0]     
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 32, 32, 32, 3 128         conv3d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 32, 32, 32, 3 128         conv3d_25[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64, 64, 64, 1 0           batch_normalization_6[0][0]      
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_79 (BatchNo (None, 16, 16, 16, 1 424         conv3d_59[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 32, 32, 32, 3 0           batch_normalization_33[0][0]     
                                                                 batch_normalization_34[0][0]     
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 64, 64, 64, 1 0           add_1[0][0]                      
__________________________________________________________________________________________________
conv3d_56 (Conv3D)              (None, 16, 16, 16, 2 40916       concatenate_7[0][0]              
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 16, 16, 16, 2 0           batch_normalization_77[0][0]     
                                                                 batch_normalization_78[0][0]     
                                                                 batch_normalization_79[0][0]     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 32, 32, 32, 3 128         add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 64, 1 64          activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_76 (BatchNo (None, 16, 16, 16, 2 848         conv3d_56[0][0]                  
__________________________________________________________________________________________________
batch_normalization_80 (BatchNo (None, 16, 16, 16, 2 848         concatenate_8[0][0]              
__________________________________________________________________________________________________
conv3d_26 (Conv3D)              (None, 32, 32, 32, 3 1056        batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv3d_27 (Conv3D)              (None, 32, 32, 32, 3 27680       batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 64, 64, 64, 1 272         batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 64, 64, 64, 1 6928        batch_normalization_8[0][0]      
__________________________________________________________________________________________________
add_20 (Add)                    (None, 16, 16, 16, 2 0           batch_normalization_76[0][0]     
                                                                 batch_normalization_80[0][0]     
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 32, 32, 32, 3 128         conv3d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 32, 32, 32, 3 128         conv3d_27[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 64, 64, 1 64          conv3d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64, 64, 64, 1 64          conv3d_8[0][0]                   
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 16, 16, 16, 2 0           add_20[0][0]                     
__________________________________________________________________________________________________
add_10 (Add)                    (None, 32, 32, 32, 3 0           batch_normalization_36[0][0]     
                                                                 batch_normalization_37[0][0]     
__________________________________________________________________________________________________
add_2 (Add)                     (None, 64, 64, 64, 1 0           batch_normalization_9[0][0]      
                                                                 batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv3d_transpose_2 (Conv3DTrans (None, 32, 32, 32, 6 108608      activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 32, 32, 32, 3 128         add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 64, 64, 1 64          add_2[0][0]                      
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 32, 32, 32, 9 0           conv3d_transpose_2[0][0]         
                                                                 batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 64, 64, 64, 1 272         batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 64, 64, 64, 1 6928        batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv3d_61 (Conv3D)              (None, 32, 32, 32, 1 44081       concatenate_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 64, 64, 64, 1 64          conv3d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 64, 64, 64, 1 64          conv3d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_82 (BatchNo (None, 32, 32, 32, 1 68          conv3d_61[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 64, 64, 1 0           batch_normalization_12[0][0]     
                                                                 batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv3d_62 (Conv3D)              (None, 32, 32, 32, 3 16100       batch_normalization_82[0][0]     
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 64, 64, 64, 1 64          add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_83 (BatchNo (None, 32, 32, 32, 3 140         conv3d_62[0][0]                  
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 64, 64, 64, 1 272         batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 64, 64, 64, 1 6928        batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv3d_63 (Conv3D)              (None, 32, 32, 32, 5 50138       batch_normalization_83[0][0]     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 64, 64, 64, 1 64          conv3d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 64, 64, 64, 1 64          conv3d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_84 (BatchNo (None, 32, 32, 32, 5 212         conv3d_63[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 64, 64, 64, 1 0           batch_normalization_15[0][0]     
                                                                 batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv3d_60 (Conv3D)              (None, 32, 32, 32, 1 10185       concatenate_9[0][0]              
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 32, 32, 32, 1 0           batch_normalization_82[0][0]     
                                                                 batch_normalization_83[0][0]     
                                                                 batch_normalization_84[0][0]     
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 64, 64, 64, 1 64          add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_81 (BatchNo (None, 32, 32, 32, 1 420         conv3d_60[0][0]                  
__________________________________________________________________________________________________
batch_normalization_85 (BatchNo (None, 32, 32, 32, 1 420         concatenate_10[0][0]             
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 64, 64, 64, 1 272         batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 64, 64, 64, 1 6928        batch_normalization_17[0][0]     
__________________________________________________________________________________________________
add_21 (Add)                    (None, 32, 32, 32, 1 0           batch_normalization_81[0][0]     
                                                                 batch_normalization_85[0][0]     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 64, 64, 1 64          conv3d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 64, 64, 64, 1 64          conv3d_14[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 32, 32, 32, 1 0           add_21[0][0]                     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 64, 64, 64, 1 0           batch_normalization_18[0][0]     
                                                                 batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv3d_transpose_3 (Conv3DTrans (None, 64, 64, 64, 3 26912       activation_25[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 64, 64, 64, 1 64          add_5[0][0]                      
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 64, 64, 64, 4 0           conv3d_transpose_3[0][0]         
                                                                 batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv3d_65 (Conv3D)              (None, 64, 64, 64, 8 10376       concatenate_11[0][0]             
__________________________________________________________________________________________________
batch_normalization_87 (BatchNo (None, 64, 64, 64, 8 32          conv3d_65[0][0]                  
__________________________________________________________________________________________________
conv3d_66 (Conv3D)              (None, 64, 64, 64, 1 3689        batch_normalization_87[0][0]     
__________________________________________________________________________________________________
batch_normalization_88 (BatchNo (None, 64, 64, 64, 1 68          conv3d_66[0][0]                  
__________________________________________________________________________________________________
conv3d_67 (Conv3D)              (None, 64, 64, 64, 2 11960       batch_normalization_88[0][0]     
__________________________________________________________________________________________________
batch_normalization_89 (BatchNo (None, 64, 64, 64, 2 104         conv3d_67[0][0]                  
__________________________________________________________________________________________________
conv3d_64 (Conv3D)              (None, 64, 64, 64, 5 2499        concatenate_11[0][0]             
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 64, 64, 64, 5 0           batch_normalization_87[0][0]     
                                                                 batch_normalization_88[0][0]     
                                                                 batch_normalization_89[0][0]     
__________________________________________________________________________________________________
batch_normalization_86 (BatchNo (None, 64, 64, 64, 5 204         conv3d_64[0][0]                  
__________________________________________________________________________________________________
batch_normalization_90 (BatchNo (None, 64, 64, 64, 5 204         concatenate_12[0][0]             
__________________________________________________________________________________________________
add_22 (Add)                    (None, 64, 64, 64, 5 0           batch_normalization_86[0][0]     
                                                                 batch_normalization_90[0][0]     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 64, 64, 64, 5 0           add_22[0][0]                     
__________________________________________________________________________________________________
conv3d_68 (Conv3D)              (None, 64, 64, 64, 3 156         activation_26[0][0]              
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 64, 64, 64, 3 0           conv3d_68[0][0]                  
==================================================================================================
Total params: 10,091,779
Trainable params: 10,077,205
Non-trainable params: 14,574
__________________________________________________________________________________________________
None
