Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 64, 64, 64,  0                                            
__________________________________________________________________________________________________
conv3d (Conv3D)                 (None, 64, 64, 64, 1 1312        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 64, 64, 64, 1 64          conv3d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 64, 64, 64, 1 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 64, 64, 64, 1 6928        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 64, 64, 1 64          conv3d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64, 64, 64, 1 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 32, 32, 32, 3 13856       activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 32, 3 128         conv3d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 32, 3 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 32, 32, 32, 3 27680       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 32, 3 128         conv3d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 32, 3 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 32, 32, 32, 3 27680       activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 32, 3 128         conv3d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 32, 3 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 16, 16, 16, 6 55360       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 16, 6 256         conv3d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 16, 16, 16, 6 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 16, 16, 16, 6 110656      activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16, 16, 16, 6 256         conv3d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 16, 16, 16, 6 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 16, 16, 16, 6 110656      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 16, 16, 16, 6 256         conv3d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 16, 16, 16, 6 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 8, 8, 8, 128) 221312      activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 8, 8, 8, 128) 512         conv3d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 8, 128) 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 8, 8, 8, 128) 442496      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 8, 8, 8, 128) 512         conv3d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 8, 128) 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 8, 8, 8, 128) 442496      activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 8, 8, 8, 128) 512         conv3d_10[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 8, 8, 8, 128) 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 4, 4, 4, 256) 884992      activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 4, 4, 4, 256) 1024        conv3d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 4, 4, 4, 256) 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 4, 4, 4, 256) 1769728     activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 4, 4, 4, 256) 1024        conv3d_12[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 4, 4, 4, 256) 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 4, 4, 4, 256) 1769728     activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 4, 4, 4, 256) 1024        conv3d_13[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 4, 4, 4, 256) 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv3d_transpose (Conv3DTranspo (None, 8, 8, 8, 128) 262272      activation_13[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 8, 8, 8, 256) 0           conv3d_transpose[0][0]           
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 8, 8, 8, 128) 884864      concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 8, 8, 8, 128) 512         conv3d_14[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 8, 128) 0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 8, 8, 8, 128) 442496      activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 8, 128) 512         conv3d_15[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 8, 128) 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv3d_transpose_1 (Conv3DTrans (None, 16, 16, 16, 6 65600       activation_15[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 16, 16, 16, 1 0           conv3d_transpose_1[0][0]         
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 16, 16, 16, 6 221248      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 16, 16, 16, 6 256         conv3d_16[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 16, 16, 16, 6 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 16, 16, 16, 6 110656      activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 16, 16, 16, 6 256         conv3d_17[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 16, 16, 16, 6 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv3d_transpose_2 (Conv3DTrans (None, 32, 32, 32, 3 16416       activation_17[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 32, 32, 6 0           conv3d_transpose_2[0][0]         
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 32, 32, 32, 3 55328       concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 32, 32, 32, 3 128         conv3d_18[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 32, 32, 32, 3 0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 32, 32, 32, 3 27680       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 32, 32, 32, 3 128         conv3d_19[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 32, 32, 32, 3 0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv3d_transpose_3 (Conv3DTrans (None, 64, 64, 64, 1 4112        activation_19[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64, 64, 64, 3 0           conv3d_transpose_3[0][0]         
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 64, 64, 64, 1 13840       concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 64, 64, 64, 1 64          conv3d_20[0][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 64, 64, 64, 1 0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 64, 64, 64, 1 6928        activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 64, 64, 64, 1 64          conv3d_21[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 64, 64, 64, 1 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 64, 64, 64, 3 51          activation_21[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 64, 64, 64, 3 0           conv3d_22[0][0]                  
==================================================================================================
Total params: 8,004,179
Trainable params: 8,000,275
Non-trainable params: 3,904
__________________________________________________________________________________________________
None
