Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 64, 64, 64,  0                                            
__________________________________________________________________________________________________
conv3d (Conv3D)                 (None, 64, 64, 64, 1 1312        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 64, 64, 64, 1 64          conv3d[0][0]                     
__________________________________________________________________________________________________
instance_normalization (Instanc (None, 64, 64, 64, 1 2           batch_normalization[0][0]        
__________________________________________________________________________________________________
activation (Activation)         (None, 64, 64, 64, 1 0           instance_normalization[0][0]     
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 64, 64, 64, 1 6928        activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 64, 64, 1 64          conv3d_1[0][0]                   
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 64, 64, 64, 1 2           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64, 64, 64, 1 0           instance_normalization_1[0][0]   
__________________________________________________________________________________________________
max_pooling3d (MaxPooling3D)    (None, 32, 32, 32, 1 0           activation_1[0][0]               
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 32, 32, 32, 3 13856       max_pooling3d[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 32, 3 128         conv3d_2[0][0]                   
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 32, 32, 32, 3 2           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 32, 3 0           instance_normalization_2[0][0]   
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 32, 32, 32, 3 27680       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 32, 3 128         conv3d_3[0][0]                   
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 32, 32, 32, 3 2           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 32, 3 0           instance_normalization_3[0][0]   
__________________________________________________________________________________________________
max_pooling3d_1 (MaxPooling3D)  (None, 16, 16, 16, 3 0           activation_3[0][0]               
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 16, 16, 16, 6 55360       max_pooling3d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 16, 16, 16, 6 256         conv3d_4[0][0]                   
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 16, 16, 16, 6 2           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 16, 16, 16, 6 0           instance_normalization_4[0][0]   
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 16, 16, 16, 6 110656      activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 16, 6 256         conv3d_5[0][0]                   
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 16, 16, 16, 6 2           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 16, 16, 16, 6 0           instance_normalization_5[0][0]   
__________________________________________________________________________________________________
max_pooling3d_2 (MaxPooling3D)  (None, 8, 8, 8, 64)  0           activation_5[0][0]               
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 8, 8, 8, 128) 221312      max_pooling3d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 8, 8, 8, 128) 512         conv3d_6[0][0]                   
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 8, 8, 8, 128) 2           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 8, 8, 8, 128) 0           instance_normalization_6[0][0]   
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 8, 8, 8, 128) 442496      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 8, 8, 8, 128) 512         conv3d_7[0][0]                   
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 8, 8, 8, 128) 2           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 8, 8, 128) 0           instance_normalization_7[0][0]   
__________________________________________________________________________________________________
conv3d_transpose (Conv3DTranspo (None, 16, 16, 16, 1 131200      activation_7[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 16, 1 0           conv3d_transpose[0][0]           
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 16, 16, 16, 1 663680      concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 16, 16, 16, 1 512         conv3d_8[0][0]                   
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 16, 16, 16, 1 2           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 16, 1 0           instance_normalization_8[0][0]   
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 16, 16, 16, 1 442496      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 16, 1 512         conv3d_9[0][0]                   
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 16, 16, 16, 1 2           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 16, 1 0           instance_normalization_9[0][0]   
__________________________________________________________________________________________________
conv3d_transpose_1 (Conv3DTrans (None, 32, 32, 32, 6 65600       activation_9[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 32, 9 0           conv3d_transpose_1[0][0]         
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 32, 32, 32, 6 165952      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 32, 32, 6 256         conv3d_10[0][0]                  
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 32, 32, 32, 6 2           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 32, 32, 6 0           instance_normalization_10[0][0]  
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 32, 32, 32, 6 110656      activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 32, 32, 32, 6 256         conv3d_11[0][0]                  
__________________________________________________________________________________________________
instance_normalization_11 (Inst (None, 32, 32, 32, 6 2           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 32, 32, 32, 6 0           instance_normalization_11[0][0]  
__________________________________________________________________________________________________
conv3d_transpose_2 (Conv3DTrans (None, 64, 64, 64, 3 16416       activation_11[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 64, 4 0           conv3d_transpose_2[0][0]         
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 64, 64, 64, 3 41504       concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 64, 64, 64, 3 128         conv3d_12[0][0]                  
__________________________________________________________________________________________________
instance_normalization_12 (Inst (None, 64, 64, 64, 3 2           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 64, 64, 64, 3 0           instance_normalization_12[0][0]  
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 64, 64, 64, 3 27680       activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 64, 64, 64, 3 128         conv3d_13[0][0]                  
__________________________________________________________________________________________________
instance_normalization_13 (Inst (None, 64, 64, 64, 3 2           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 64, 64, 64, 3 0           instance_normalization_13[0][0]  
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 64, 64, 64, 3 99          activation_13[0][0]              
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 64, 64, 64, 3 0           conv3d_14[0][0]                  
==================================================================================================
Total params: 2,548,623
Trainable params: 2,546,767
Non-trainable params: 1,856
__________________________________________________________________________________________________
None
